app/controllers/verses_controller.rb

SELECT "verses".* FROM "verses" WHERE "verses"."code" IS NULL LIMIT 1
---
def unlock
	testverse = Verse.new(params[:verse].permit(:code))
	@verse = Verse.find_by code: testverse.code