app/controllers/verses_controller.rb

def index
	@showUnlock = false
	@verses = Verse.all
---
SELECT "verses".* FROM "verses" ORDER BY "verses".id ASC

def create
	testverse = Verse.new(params[:verse].permit(:code))
	@verse = Verse.find_by code: testverse.code
	if @verse
		@verse.unlocked = true
		@verse.save
---
SELECT "verses".* FROM "verses" WHERE "verses"."code" = '135345353' LIMIT 1
INSERT INTO "verses" ("code", "created_at", "unlocked", "updated_at") VALUES ($1, $2, $3, $4) RETURNING "id"  [["code", "12345"], ["created_at", Mon, 10 Mar 2014 23:00:12 UTC +00:00], ["unlocked", false], ["updated_at", Mon, 10 Mar 2014 23:00:12 UTC +00:00]]
UPDATE "verses" SET "unlocked" = ?, "updated_at" = ? WHERE "verses"."id" = 1  [["unlocked", true], ["updated_at", Tue, 29 Oct 2013 00:37:50 UTC +00:00]]

def checkcode
	testverse = Verse.new(params[:verse].permit(:code))
	@verse = Verse.find_by code: testverse.code
	if @verse
		@verse.unlocked = true
		@verse.save
---
SELECT "verses".* FROM "verses" WHERE "verses"."code" = '1234' LIMIT 1
UPDATE "verses" SET "unlocked" = ?, "updated_at" = ? WHERE "verses"."id" = 1  [["unlocked", true], ["updated_at", Mon, 28 Oct 2013 23:05:52 UTC +00:00]]